using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class ScTextHsy : MonoBehaviour
{
    public static Dictionary<string, string> DialogueMap = new Dictionary<string, string>()
    {
        { "1", "괜찮아. 누구나 실수할 수 있는 거야." },
        { "2", "방금 있었던 일이 왜 위험했는지, 같이 살펴보자!" },
        { "3", "아까 너는 그냥 걸어가기만 했지? 손은 안 들었더라." },
        { "4", "손을 안 들면, 차에 있는 사람들이 널 못 보고 차가 그냥 지나갈 수도 있어!" },
        { "5", "그럼 아야하겠지? 그래서 조심해야 해!" },
        { "6", "차에 있는 사람들은, 앞이나 옆이 잘 안 보일 때도 있어." },
        { "7", "그래서 우리가 먼저 손을 들어서 알려주는 게 좋아." },
        { "8", "봐봐, 손도 안 들고 그냥 건너고 있지?" },
        { "9", "손을 안 들면, 운전자도 못 보고 멈추기 어려울 수 있어." },
        { "10", "그럼, 이제 어떻게 하면 되는지 같이 볼까?" },
        { "11", "이 친구는 건널 때 손을 들고 있지?" },
        { "12", "그럼 차에 있는 사람들도 금방 알아볼 수 있어서 안전하게 건널 수 있어!" },
        { "13", "어때? 이제 어떻게 하면 좋은지 알겠지?" },
        { "14", "다시 한번 도로로 돌아가서 다시 도전하자!" }
    };
}
